{"longName": "Hindustan Unilever Limited", "sector": "Consumer Defensive", "website": "https://www.hul.co.in", "address1": "Unilever House", "address2": "B. D. Sawant Marg Chakala Andheri (East)", "city": "Mumbai", "country": "India", "zip": "400099", "phone": "91 22 5043 3000", "fullTimeEmployees": "18970", "longBusinessSummary": "Hindustan Unilever Limited, a fast-moving consumer good company, manufactures and sells food, home care, personal care, and refreshment products in India and internationally. The company operates through Home Care, Beauty & Personal Care, Foods & Refreshment, and Others segments. The Home Care segment engages in detergent bars and powders, detergent liquids, scourers, water business, purifiers business, etc. The Beauty & Personal Care segment provides oral, skin, and hair care products; and soaps, deodorants, talcum powder, color cosmetics, salon services, etc. The Foods & Refreshment segment provides culinary products, including tomato-based products, fruit-based products, soups, etc.; and tea, coffee, health food drinks, ice-creams, and frozen desserts. The Others segment engages in activities, such as export, consignment, etc. The company is also involved in the job work, real estate, and discharge trust activities. The company was founded in 1888 and is headquartered in Mumbai, India. Hindustan Unilever Limited is a subsidiary of Unilever Plc.", "totalCash": "72649998336", "totalDebt": "12190000128", "totalRevenue": "605799972864", "symbol": "HINDUNILVR.NS", "currentPrice": "2757.1", "marketCap": "6478054817792", "open": "2759.9", "dayLow": "2735.65", "dayHigh": "2765.0", "previousClose": "2755.85", "fiftyTwoWeekHigh": "2765.0", "fiftyTwoWeekLow": "2393.0", "52WeekChange": "11.439776", "fiftyDayAverage": "2630.08", "twoHundredDayAverage": "2579.5076", "overallRisk": "3", "recommendationKey": "none", "volume": "1264807", "averageVolume": "1323804", "returnOnEquity": "0.20368", "returnOnAssets": "0.11305001", "pegRatio": "None", "priceToBook": "12.877809", "trailingEps": "44.09", "revenuePerShare": "257.832", "totalCashPerShare": "30.92", "bid": "0.0", "ask": "0.0"}