{"longName": "MRF Limited", "sector": "Consumer Cyclical", "website": "https://www.mrftyres.com", "address1": "No. 114, Greams Road", "address2": "None", "city": "Chennai", "country": "India", "zip": "600006", "phone": "91 44 2829 2777", "fullTimeEmployees": "None", "longBusinessSummary": "MRF Limited, together with its subsidiaries, manufactures, sells, and trades in rubber products in India and internationally. The company provides rubber products, such as tires, tubes, flaps, and tread rubber; tires for trucks, farm vehicles, LCVs, SCVs, MCVs, three wheelers, pick up, two wheelers, passenger cars, and OTRs; and manufactures specialty coatings. It also involved in the paints and coats, toys, motorsports, and cricket training businesses. In addition, the company operates MRF T&S, MRF TireTok, MRF Tyredrome, MRF FASST, MRF MuscleZone, and shops that provide computerized nitrogen inflation, tubeless repair, wheel alignment, wheel balancing and tire changing; robotic wheel alignment, vehicle safety test lane, diagnostic wheel balancing, A/C recovery and recharging, electronic headlight aligner, nitrogen generator membrane type, and special two-wheeler tire changer; and wheels removal and refitment, and tire mounting and de-mounting services. It sells its products through dealer networks. MRF Limited was founded in 1946 and is based in Chennai, India.", "totalCash": "22233499648", "totalDebt": "30136100864", "totalRevenue": "230150193152", "symbol": "MRF.NS", "currentPrice": "101227.65", "marketCap": "429320634368", "open": "101180.0", "dayLow": "100680.0", "dayHigh": "101974.95", "previousClose": "101306.5", "fiftyTwoWeekHigh": "101974.95", "fiftyTwoWeekLow": "75300.0", "52WeekChange": "33.21923", "fiftyDayAverage": "97517.24", "twoHundredDayAverage": "90016.92", "overallRisk": "None", "recommendationKey": "underperform", "volume": "6352", "averageVolume": "8939", "returnOnEquity": "0.05351", "returnOnAssets": "0.0315", "pegRatio": "1.09", "priceToBook": "2.9190297", "trailingEps": "1853.91", "revenuePerShare": "54266.08", "totalCashPerShare": "5242.337", "bid": "0.0", "ask": "0.0"}