{"longName": "Reliance Industries Limited", "sector": "Energy", "website": "https://www.ril.com", "address1": "Maker Chambers IV", "address2": "3rd Floor 222 Nariman Point", "city": "Mumbai", "country": "India", "zip": "400021", "phone": "91 22 3555 5000", "fullTimeEmployees": "None", "longBusinessSummary": "Reliance Industries Limited engages in hydrocarbon exploration and production, oil and chemicals, textile, retail, digital, and financial services businesses worldwide. The company produces and markets petroleum products, such as liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosene oil, diesel, Sulphur, and petroleum coke. It also provides petrochemicals, including high-density and low-density polyethylene (PE), linear low density PE, polyester fibers and yarns, polypropylene, polyvinyl chloride, purified terephthalic acid, ethylene glycols and oxide, paraxylene, ortho xylene, benzene, linear alkyl benzene and paraffin, poly butadiene rubber, styrene butadiene rubber, butyl rubber, and polyethylene terephthalate. In addition, the company manufactures and markets yarns, fabrics, apparel, and auto furnishings; explores, develops, and produces crude oil and natural gas; and operates various stores comprising neighborhood, supermarket, hypermarket, wholesale cash and carry, specialty, pharmacy, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, consumer electronics, connectivity products, and others. It operates 15,196 retail stores. Further, the company provides range of digital services under the Jio brand name; and non-banking financial and insurance broking services. Additionally, it operates news and entertainment platforms, and Network18 and television channels; publishes magazines; and offers highway hospitality and fleet management services. The company was incorporated in 1973 and is based in Mumbai, India.", "totalCash": "2034269945856", "totalDebt": "3351340122112", "totalRevenue": "8794680066048", "symbol": "RELIANCE.NS", "currentPrice": "2633.6", "marketCap": "17819227914240", "open": "2635.0", "dayLow": "2628.0", "dayHigh": "2664.95", "previousClose": "2638.75", "fiftyTwoWeekHigh": "2755.0", "fiftyTwoWeekLow": "2180.0", "52WeekChange": "10.343313", "fiftyDayAverage": "2495.951", "twoHundredDayAverage": "2459.394", "overallRisk": "6", "recommendationKey": "buy", "volume": "6171151", "averageVolume": "4882573", "returnOnEquity": "0.08127", "returnOnAssets": "0.03991", "pegRatio": "None", "priceToBook": "2.1702569", "trailingEps": "100.54", "revenuePerShare": "1299.912", "totalCashPerShare": "300.624", "bid": "0.0", "ask": "0.0"}