{"longName": "State Bank of India", "sector": "Financial Services", "website": "https://www.sbi.co.in", "address1": "State Bank Bhavan", "address2": "14th Floor Corporate Centre Madame Cama Road, Nariman Point", "city": "Mumbai", "country": "India", "zip": "400021", "phone": "91 22 2274 0841", "fullTimeEmployees": "235858", "longBusinessSummary": "State Bank of India provides banking products and services to individuals, commercial enterprises, corporates, public bodies, and institutional customers in India and internationally. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, Insurance Business, and Other Banking Business segments. It offers personal banking products and services, including current accounts, savings accounts, salary accounts, fixed and recurring deposits, and flexi and annual deposits; home, personal, auto, education, and gold loans, as well as loans against property and securities; overdrafts; mutual funds, insurance, equity trading, portfolio investment schemes, remittance services; and mobile, internet, and digital banking services. The company also provides corporate banking products and services comprising corporate accounts, working capital and project finance, deferred payment guarantees, corporate term loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms overseas subsidiaries or JVs, cash management, and asset-backed loans, as well as trade and service products. In addition, it offers NRI services, including accounts and deposits, remittances, investments, and loans; agricultural banking and micro-credit to agriculturists and farmers; supply chain finance, and deposits and transaction banking services for SME customers; and international banking services. Further, the company provides treasury, broking, bill payment, and MICR services; and merchant banking, advisory, securities broking, business & management consultancy, trustee business, factoring, payment, asset management, investment management, credit cards, and custody and fund accounting services. It also offers support and business correspondent services. The company was founded in 1806 and is headquartered in Mumbai, India.", "totalCash": "926192762880", "totalDebt": "5214413258752", "totalRevenue": "2463729188864", "symbol": "SBIN.NS", "currentPrice": "593.6", "marketCap": "5297648173056", "open": "590.0", "dayLow": "585.5", "dayHigh": "595.5", "previousClose": "592.5", "fiftyTwoWeekHigh": "629.55", "fiftyTwoWeekLow": "474.7", "52WeekChange": "21.277248", "fiftyDayAverage": "577.888", "twoHundredDayAverage": "568.13324", "overallRisk": "8", "recommendationKey": "strong_buy", "volume": "11699270", "averageVolume": "17787031", "returnOnEquity": "0.16774", "returnOnAssets": "0.01021", "pegRatio": "0.41", "priceToBook": "1.4759523", "trailingEps": "62.69", "revenuePerShare": "276.06", "totalCashPerShare": "103.78", "bid": "0.0", "ask": "593.6"}