{"longName": "The Tata Power Company Limited", "sector": "Utilities", "website": "https://www.tatapower.com", "address1": "Corporate Center B", "address2": "34 Sant Tukaram Road Carnac Bunder", "city": "Mumbai", "country": "India", "zip": "400 009", "phone": "91 22 6665 8282", "fullTimeEmployees": "23025", "longBusinessSummary": "The Tata Power Company Limited engages in the generation, transmission, distribution, and trading of electricity in India and internationally. It operates through Generation, Renewables, Transmission and Distribution, and Others segments. The Generation segment generates power from hydroelectric and thermal sources, such as coal, gas, and oil. The Renewables segment generates power from renewable energy sources, which include wind and solar. The Transmission and Distribution segment transmits and distributes electricity; sells power to retail customers through distribution network and related ancillary services. The Others segment offers project management contracts/infrastructure management, and property development services, as well as rents oil tanks. The company also manufactures and sells solar photovoltaic cells and modules, and pumps; operates electric vehicle charging stations and coal mines; generates electricity through waste heat sources; trades in power; and provides engineering, procurement, and construction, as well as logistics services. In addition, it offers microgrid, rooftop solar, and home automation solutions. The company has an installed capacity of 14,110 MW. The Tata Power Company Limited was founded in 1915 and is based in Mumbai, India.", "totalCash": "124877897728", "totalDebt": "534993108992", "totalRevenue": "551090782208", "symbol": "TATAPOWER.NS", "currentPrice": "228.0", "marketCap": "728913739776", "open": "229.8", "dayLow": "226.1", "dayHigh": "232.35", "previousClose": "229.6", "fiftyTwoWeekHigh": "251.15", "fiftyTwoWeekLow": "182.35", "52WeekChange": "4.3399215", "fiftyDayAverage": "214.086", "twoHundredDayAverage": "211.21275", "overallRisk": "5", "recommendationKey": "none", "volume": "16580097", "averageVolume": "8361497", "returnOnEquity": "0.12269", "returnOnAssets": "0.0238", "pegRatio": "None", "priceToBook": "2.4266162", "trailingEps": "10.86", "revenuePerShare": "172.314", "totalCashPerShare": "39.081", "bid": "0.0", "ask": "0.0"}