{"longName": "Tata Consultancy Services Limited", "sector": "Technology", "website": "https://www.tcs.com", "address1": "TCS House", "address2": "Raveline Street Fort", "city": "Mumbai", "country": "India", "zip": "400001", "phone": "91 22 6778 9595", "fullTimeEmployees": "614795", "longBusinessSummary": "Tata Consultancy Services Limited provides information technology (IT) and IT enabled services worldwide. It operates through Banking, Financial Services and Insurance; Manufacturing; Retail and Consumer Business; Communication, Media and Technology; Life Sciences and Healthcare; and Others segments. The company provides TCS ADD, a suite of technology platforms for clinical research and drug development; TCS BaNCS, a financial solution platform; TCS BFSI Platforms, a cloud-native, as-a-service that helps FIs and insurance firms; TCS CHROMA, a cloud-based talent management solution; customer intelligence and insight solutions; TCS ERP on Cloud, a hosted ERP applications and services platform; TCS HOBS, a connected devices management platform; and ignio, an autonomous enterprise software. It also offers TCS Intelligent Urban Exchange, smart cities and enterprises solution; TCS OmniStore, a commerce platform; TCS OPTUMERA, a retail-connected strategic intelligence platform; TCS TAP, a procurement offering; TCS MasterCraft, a platform of intelligent automation products; Quartz- the Smart Ledgers, a blockchain solution; Jile, an enterprise agile planning and delivery tool; TCS iON, an IT-as-a-Service model that provides business solutions; and TCS TwinX, an enterprise digital twin platform. In addition, the company provides cloud, cognitive business, consulting, cybersecurity, data and analytics, enterprise solutions, Internet of Things and digital engineering, TCS interactive, and sustainability services. It serves capital markets; communications, media, and information services; public services; energy, resource, and utility industries; consumer goods and distribution industries; and banking, education, healthcare, high tech, insurance, life science, manufacturing, retail, travel, and logistics industries. The company was founded in 1968 and is headquartered in Mumbai, India. Tata Consultancy Services Limited is a subsidiary of Tata Sons Private Limited.", "totalCash": "455260012544", "totalDebt": "76880003072", "totalRevenue": "2254579957760", "symbol": "TCS.NS", "currentPrice": "3329.25", "marketCap": "12181892497408", "open": "3302.0", "dayLow": "3302.0", "dayHigh": "3356.9", "previousClose": "3322.9", "fiftyTwoWeekHigh": "3575.0", "fiftyTwoWeekLow": "2926.1", "52WeekChange": "1.7593265", "fiftyDayAverage": "3254.437", "twoHundredDayAverage": "3272.7822", "overallRisk": "5", "recommendationKey": "hold", "volume": "1787817", "averageVolume": "1934281", "returnOnEquity": "0.4673", "returnOnAssets": "0.23774", "pegRatio": "2.47", "priceToBook": "13.471982", "trailingEps": "115.64", "revenuePerShare": "616.165", "totalCashPerShare": "124.42", "bid": "0.0", "ask": "0.0"}